app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `username` = 'jin'
 LIMIT 1
---
    public function login()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Load model user
        $userModel = new UserModel();

        // Cari user berdasarkan username
        $user = $this->userModel->where('username', $username)->first();