app/Controllers/Registrasi.php

    public function getKelasByProdi($prodi_id = null)
    {
        $this->response->setContentType('application/json');

        try {
            if (empty($prodi_id)) {
                return $this->response->setJSON(['success' => false, 'data' => []]);
            }

            $kelas = $this->kelasModel->where('program_studi_id', $prodi_id)
                                      ->orderBy('nama_kelas', 'ASC')
                                      ->findAll();
---
SELECT *
FROM `kelas`
WHERE `program_studi_id` = '1'
ORDER BY `nama_kelas` ASC