app/Models/PendaftarModel.php

SELECT `calon_pendaftar`.*, `kelas`.`nama_kelas`, `program_studi`.`nama_program_studi`, `referensi_informasi`.`nama_referensi`
FROM `calon_pendaftar`
JOIN `kelas` ON `kelas`.`kelas_id` = `calon_pendaftar`.`kelas_id`
JOIN `program_studi` ON `program_studi`.`program_studi_id` = `kelas`.`program_studi_id`
LEFT JOIN `referensi_informasi` ON `referensi_informasi`.`referensi_id` = `calon_pendaftar`.`referensi_id`
---
  public function getLengkap()
  {
    return $this->select('calon_pendaftar.*, kelas.nama_kelas, program_studi.nama_program_studi, referensi_informasi.nama_referensi')
      ->join('kelas', 'kelas.kelas_id = calon_pendaftar.kelas_id')
      ->join('program_studi', 'program_studi.program_studi_id = kelas.program_studi_id')
      ->join('referensi_informasi', 'referensi_informasi.referensi_id = calon_pendaftar.referensi_id', 'left')
      ->findAll();

SELECT `calon_pendaftar`.*, `kelas`.`nama_kelas`, `kelas`.`program_studi_id`, `program_studi`.`nama_program_studi`, `referensi_informasi`.`nama_referensi`
FROM `calon_pendaftar`
JOIN `kelas` ON `kelas`.`kelas_id` = `calon_pendaftar`.`kelas_id`
JOIN `program_studi` ON `program_studi`.`program_studi_id` = `kelas`.`program_studi_id`
LEFT JOIN `referensi_informasi` ON `referensi_informasi`.`referensi_id` = `calon_pendaftar`.`referensi_id`
WHERE `calon_pendaftar`.`nik` = '1473890247192380'
 LIMIT 1
---
  public function getByNik(string $nik)
  {
    return $this->select('calon_pendaftar.*, kelas.nama_kelas, kelas.program_studi_id, program_studi.nama_program_studi, referensi_informasi.nama_referensi')
      ->join('kelas', 'kelas.kelas_id = calon_pendaftar.kelas_id')
      ->join('program_studi', 'program_studi.program_studi_id = kelas.program_studi_id')
      ->join('referensi_informasi', 'referensi_informasi.referensi_id = calon_pendaftar.referensi_id', 'left')
      ->where('calon_pendaftar.nik', $nik)
      ->first();